#                __          
#       ___ ___ / /  ________
#     _/_ /(_-</ _ \/ __/ __/
#    (_)__/___/_//_/_/  \__/ 
#                            
#
# ======================================================
# ЗАГРУЗКА КОНФИГУРАЦИИ ПО МОДУЛЯМ
# ======================================================
for f in ~/.config/zshrc/*; do
    if [ ! -d $f ] ;then
        c=`echo $f | sed -e "s=.config/zshrc=.config/zshrc/custom="`
        [[ -f $c ]] && source $c || source $f
    fi
done
# ======================================================
# ЗАГРУЗКА ОДНОГО ФАЙЛА КОНФИГУРАЦИИ (ЕСЛИ СУЩЕСТВУЕТ)
# ======================================================
if [ -f ~/.zshrc_custom ] ;then
    source ~/.zshrc_custom
fi