#               _             
#       ___ ___| |_   _ _  __ 
#    _ |_ /(_-<| ' \ | '_|/ _|
#   (_)/__|/__/|_||_||_|  \__|
#                                                        
# ======================================================
# Загрузка конфигурации по модулям (если существуют)
# ======================================================
for f in ~/.config/zshrc/*; do
    if [ ! -d $f ] ;then
        c=`echo $f | sed -e "s=.config/zshrc=.config/zshrc/custom="`
        [[ -f $c ]] && source $c || source $f
    fi
done
# ======================================================
# Загрузка одного файла конфигурации (если существует)
# ======================================================
if [ -f ~/.zshrc_custom ] ;then
    source ~/.zshrc_custom
fi
# ======================================================
# Загрузка кастомизации командной строки через OhMyPosh
# ======================================================
eval "$(oh-my-posh init zsh --config ~/.config/ohmyposh/theme.toml)"
